[{"category":"business","title":"Rupee hits all-time low of 77.42 against US dollar","content":"The Indian rupee fell to an all-time low of 77.42 against the US dollar on Monday, Reuters reported. Asian markets were lower on Monday as US stock futures fell on fears of more policy tightening from the Federal Reserve and strict lockdown in Shanghai impacting global growth, according to Reuters.","author":"Apaar Sharma","published":"2022-05-09T05:05:31.000Z"},{"category":"business","title":"Bitcoin falls to the lowest level since January, trades below $34,000","content":"Bitcoin fell on Monday to as low as $33,266 in morning trade, nearing January's low of $32,951 as slumping equity markets continued to hurt cryptocurrencies. It then steadied to trade above $33,600. According to BBC, the world's largest cryptocurrency has fallen by 50% since its peak in November 2021.","author":"Pragya Swastik","published":"2022-05-09T09:20:34.000Z"},{"category":"business","title":"Made best possible decision: IndiGo on barring differently-abled child from flight","content":"IndiGo's CEO Ronojoy Dutta said the airline made \"the best possible decision\" by barring a differently-abled teenager and his family from boarding a Ranchi-Hyderabad flight. \"At boarding area, the teenager was visibly in panic...the airport staff, in line with safety guidelines, were forced to make a difficult decision,\" Dutta said. IndiGo offered to purchase an electric wheelchair for the child. ","author":"Pragya Swastik","published":"2022-05-09T09:50:34.000Z"},{"category":"business","title":"Rupee closes at all-time low of 77.50 against US dollar","content":"The Indian rupee weakened further on Monday to close at a new all-time low of 77.50 against the US dollar, 60 paise over its previous close. During the trading session, the rupee touched its lifetime low of 77.52. The currency was weighed down by elevated crude oil prices and a widening trade deficit.","author":"Pragya Swastik","published":"2022-05-09T15:27:43.000Z"},{"category":"business","title":"India's biggest IPO of LIC subscribed nearly 3 times on final day of bidding","content":"LIC's IPO, India's biggest IPO which opened on May 4 and closed on May 9, was subscribed 2.95 times on Monday. Expected to raise ₹20,557 crore, the IPO received bids for 47.83 crore equity shares against the IPO size of 16.2 crore shares. The policyholders' portion was subscribed 6.11 times, employees bid 4.39 times and retail investors bid 1.99 times.\n\n","author":"Pragya Swastik","published":"2022-05-09T14:10:38.000Z"},{"category":"business","title":"If I die under mysterious circumstances, nice knowing ya: Musk after Russian threats","content":"Tesla CEO Elon Musk has tweeted, \"If I die under mysterious circumstances, it's been nice knowing ya.\" Shortly before this, Musk shared a post that he said was a statement by the Roscosmos director Dmitry Olegovich Rogozin to Russian media that accused Musk of supplying \"fascist forces in Ukraine\". \"Elon, you'll be held accountable like an adult,\" the statement read.\n","author":"Ridham Gambhir","published":"2022-05-09T03:20:24.000Z"},{"category":"business","title":"Japan will cease to exist, Venice dying due to very low birth rates: Musk","content":"The world's richest man Elon Musk recently tweeted, \"At the risk of stating the obvious, unless something changes to cause the birth rate to exceed the death rate, Japan will eventually cease to exist.\" He added, \"This would be a great loss for the world.\" In another tweet, Musk said, \"Venice is slowly dying due to very low birth rates.\"","author":"Pragya Swastik","published":"2022-05-09T13:17:57.000Z"},{"category":"business","title":"I will do my best to stay alive: Musk to his mother after 'mysterious dying' tweet","content":"Soon after Tesla CEO Elon Musk shared a tweet about his \"mysterious death\", his mother Maye Musk commented that it wasn't funny. Responding to her, Musk wrote, \"Sorry! I will do my best to stay alive.\" Musk's 'dying' tweet came after he shared a statement by the Roscosmos director that threatened him for supplying \"fascist forces\" to Ukraine. ","author":"Ridham Gambhir","published":"2022-05-09T04:21:36.000Z"},{"category":"business","title":"Uber will treat hiring as a 'privilege' to cut costs: CEO","content":"Uber CEO Dara Khosrowshahi told employees in an e-mail that the company needs to cut costs, citing \"the market is experiencing a seismic shift\", CNBC reported. \"We'll treat hiring as a privilege and be deliberate about when and where we add headcount,\" the CEO said. \"We have to make sure our unit economics work before we go big,\" he added.","author":"Pragya Swastik","published":"2022-05-09T11:24:49.000Z"},{"category":"business","title":"Investigating it myself: Scindia after IndiGo denies boarding to differently-abled child","content":"Union Civil Aviation Minister Jyotiraditya Scindia said he is investigating the matter himself wherein IndiGo denied boarding to a differently-abled child at the Ranchi airport. He added that appropriate action will also be taken. A social media post along with a video of the incident went viral on Sunday after it detailed how IndiGo staff denied boarding to the child.\n","author":"Ridham Gambhir","published":"2022-05-09T04:10:22.000Z"},{"category":"business","title":"GST Council may consider highest 28% tax on cryptocurrencies: Report","content":"The GST Council is considering levying a 28% tax on cryptocurrencies and their related services, as per a report. While the proposal is likely to be discussed in the next GST Council meeting, its date is yet to be decided. Notably, the Finance Ministry has already imposed a 30% income tax on earnings from virtual digital asset transactions.","author":"Ridham Gambhir","published":"2022-05-09T04:52:02.000Z"},{"category":"business","title":"British airline EasyJet to take out seats from planes so it can fly with fewer crew","content":"British low-cost airline EasyJet plans to remove seats on some of its planes so it can operate flights with fewer cabin crew. The airline, which has been facing a staff shortage, is cancelling around 30 flights daily. It will be removing the back row from 60 of its A319 jets, which will limit the passengers to 150 instead of 156.","author":"Ridham Gambhir","published":"2022-05-09T03:52:54.000Z"},{"category":"business","title":"US imposes new sanctions on 27 Gazprombank, 8 Sberbank executives","content":"The US on Sunday imposed new sanctions against three Russian television stations and banned 27 executives from Gazprombank in response to Ukraine's invasion of Russia. This is the first time that the US has imposed sanctions involving Russian gas exporter Gazprombank. The new sanctions also included eight executives from Sberbank, and Moscow Industrial Bank and its 10 subsidiaries.","author":"Ashley Paul","published":"2022-05-08T17:21:03.000Z"},{"category":"business","title":"Rupee is in ICU under PM Modi: Cong after rupee hits all-time low","content":"Congress leader Randeep Surjewala on Monday said the Indian rupee \"is in ICU (intensive care unit)\" under PM Narendra Modi's government after the rupee fell to an all-time low of ₹77.42 against the US dollar. Surjewala said rising inflation and depleting foreign reserves are causing the rupee to fall. \"BJP-sponsored\" communal tension is also responsible for the fall, he added.","author":"Ashley Paul","published":"2022-05-09T10:54:51.000Z"},{"category":"business","title":"Toyota to invest ₹4,800 cr in Karnataka, will create 3,500 jobs","content":"The Toyota Group has signed an MoU with the Karnataka government for a ₹4,800 crore investment in the state. As per the company's statement, the investment aims to promote green technology and set up local manufacturing facilities to build electric powertrain parts and components. The move will generate around 3,500 direct jobs, said Toyota Kirloskar Motor's Executive VP Vikram Gulati. ","author":"Ananya Goyal","published":"2022-05-09T15:29:35.000Z"},{"category":"business","title":"Paytm grants 39.7 lakh ESOPs to employees as its share price falls","content":"Paytm-parent One97 Communications has granted 39.7 lakh new employee stock ownership plans (ESOPs) to its employees as Paytm's share price fell to one of its lowest levels since November. The exercise price of the new ESOPs has been set at ₹9 each. As per Paytm's stock price on Monday, the value of the ESOPs is estimated to be ₹220.7 crore.","author":"Ashley Paul","published":"2022-05-09T11:10:28.000Z"},{"category":"business","title":"LIC's public issue has been successful: DIPAM Secretary","content":"Department of Investment and Public Asset Management (DIPAM) Secretary Tuhin Kanta Pandey on Monday said the LIC's IPO offer \"has met with tremendous success\". The LIC IPO, which started on May 4, has been closed today after being oversubscribed 2.95 times. While the policyholder position has been subscribed 6.11 times, the employees portion has been subscribed 4.39 times.","author":"Ashley Paul","published":"2022-05-09T14:51:40.000Z"},{"category":"business","title":"NCLT orders insolvency proceedings against Birla Tyres","content":"The National Company Law Tribunal (NCLT) has ordered the initiation of insolvency proceedings against Birla Tyres in a case filed by multi-business chemicals firm SRF. As per SRF, Birla Tyres defaulted on payment of ₹15.84 crore for the supply of tyre cord fabric as of July 8, 2021. NCLT reprimanded Birla Tyres for taking a \"casual attempt\" to seek adjournments.","author":"Ananya Goyal","published":"2022-05-09T17:54:44.000Z"},{"category":"business","title":"Adani Airports raises $250 million for airports development","content":"Adani Airports has raised $250 million funding from a consortium of Standard Chartered and Barclays Bank with an option to raise another $200 million. The funds raised will be used to scale up the airports business into \"one of the largest airport platforms globally,\" a spokesperson said. Adani Airports manages airports in Mumbai, Ahmedabad, Lucknow, Mangaluru and Jaipur, among others.","author":"Ananya Goyal","published":"2022-05-09T13:25:31.000Z"},{"category":"business","title":"Unemployment rate fell from 10.3% to 8.7% in Oct-Dec 2021: NSO","content":"The unemployment rate for people above 15 years in urban areas slipped from 10.3% to 8.7% between October and December 2021, the National Statistical Office (NSO) data revealed on Sunday. Among males, the unemployment rate dipped to 8.3% in October-December 2021 compared to 9.5% a year ago. Meanwhile, among females, the rate fell from 13.1% to 10.5% y-o-y.","author":"Ananya Goyal","published":"2022-05-08T15:51:54.000Z"},{"category":"business","title":"LIC IPO booked 1.79 times on Day 5; policyholders booked 5.04 times","content":"Life Insurance Corporation's (LIC) public issue was subscribed 1.79 times on the fifth day of bidding on Sunday. The offer has received bids for 29.07 crore equity shares against the IPO size of 16.2 crore equity shares. The policyholder portion was booked 5.04 times, followed by the employee portion, which was booked 3.79 times.","author":"Ashley Paul","published":"2022-05-08T15:37:49.000Z"},{"category":"business","title":"LIC IPO shares to be allocated on May 12, listing on May 17","content":"Bidders in LIC IPO will be allocated shares on May 12, Department of Investment and Public Asset Management (DIPAM) Secretary Tuhin Kanta Pandey has said. He added that LIC will be listed on stock exchanges on May 17. The IPO, which opened on May 4 and closed on May 9, received 47.83 crore bids against 16.2 crore shares on offer.","author":"Ananya Goyal","published":"2022-05-09T17:07:46.000Z"},{"category":"business","title":"Reliance's shares decline 3% after Q4 results, fall 9.8% in 6 days","content":"Reliance Industries Limited's (RIL) shares declined 3% to ₹2,542.10 in the early hours of trading on Monday after the company's January-March quarter results were declared. RIL's shares have fallen 9.82% since April 29. RIL reported a 22.5% YoY rise in net profit to ₹16,203 crore and a 35% YoY rise in consolidated revenue to ₹2.32 lakh crore in Q4 FY22.","author":"Ashley Paul","published":"2022-05-09T10:01:23.000Z"},{"category":"business","title":"Deeply distressed with rumour mongering: Axis AMC Founder CEO on alleged scam","content":"Axis Asset Management Company (AMC) Founder CEO Rajiv Anand on Monday said he is deeply depressed with rumour mongering regarding allegations that two of fund managers (FMs) at Axis Mutual Fund have been removed from their positions for front-running. \"If there is a problem, we will address it. Do not malign the reputations of the highly skilled professionals,\" Anand said.\n","author":"Ashley Paul","published":"2022-05-09T15:00:12.000Z"},{"category":"business","title":"Retail investors have become shock absorbers in equities: FM","content":"Finance Minister Nirmala Sitharaman said retail investors have played a key role in the markets in the last two years. \"[They] have shown...what they can do by standing up and becoming shock absorbers, unlike FPIs,\" she stated. Her statement comes as foreign portfolio investors pulled out ₹6,417 crore from the Indian stock markets in the first week of May.","author":"Ananya Goyal","published":"2022-05-08T17:19:58.000Z"},{"category":"sports","title":"Alyssa Healy, Keshav Maharaj named ICC Players of the Month for April","content":"Australia wicketkeeper-batter Alyssa Healy and South Africa spinner Keshav Maharaj have been voted as the ICC Women’s and Men’s Players of the Month, respectively for April 2022. Healy won the award for her match-winning innings of 170 in the 2022 Women's World Cup final against England. Meanwhile, Maharaj won the award for taking 16 wickets in two Tests against Bangladesh.","author":"Anmol Sharma","published":"2022-05-09T10:39:41.000Z"},{"category":"sports","title":"MI to bowl first against KKR; MI make 1 change, KKR make 5 changes","content":"MI captain Rohit Sharma won the toss and elected to bowl first against KKR in their IPL 2022 match on Monday. MI have made one change to their playing XI, with injured Suryakumar Yadav being replaced by Ramandeep Singh. Meanwhile, KKR have included Ajinkya Rahane, Venkatesh Iyer, Sheldon Jackson, Pat Cummins and Varun Chakaravarthy in their playing XI.","author":"Anmol Sharma","published":"2022-05-09T13:49:44.000Z"},{"category":"sports","title":"Jasprit Bumrah records best bowling figures of IPL 2022","content":"MI fast bowler Jasprit Bumrah on Monday recorded the best bowling figures of IPL 2022 so far. The 28-year-old registered figures of 4-1-10-5 against KKR. The previous best bowling figures in IPL 2022 were recorded by RCB leg-spinner Wanindu Hasaranga, who had taken five wickets for 18 runs against SRH. Bumrah has now taken 10 wickets in IPL 2022.","author":"Anmol Sharma","published":"2022-05-09T16:13:11.000Z"},{"category":"sports","title":"I was contemplating retiring out to get Dinesh Karthik in: Faf du Plessis","content":"RCB captain Faf du Plessis has revealed that he was contemplating retiring out against SRH to get Dinesh Karthik in. Talking about Dinesh Karthik scoring 30*(8), Du Plessis said, \"If Karthik keeps hitting sixes like that, everyone always wants to get him in and bat for as long as possible...He’s just so clear.\"","author":"Anmol Sharma","published":"2022-05-09T11:24:08.000Z"},{"category":"sports","title":"Suryakumar Yadav ruled out of remaining IPL 2022 matches","content":"MI batter Suryakumar Yadav has been ruled out of the remaining matches of IPL 2022 owing to a left forearm muscle injury. He had sustained the injury during MI's match against GT on May 6. Suryakumar played 8 matches for MI this season, scoring 303 runs at an average of 43.29, including three half centuries.","author":"Anmol Sharma","published":"2022-05-09T13:23:04.000Z"},{"category":"sports","title":"Rohit's shocked reaction after his controversial DRS dismissal goes viral, fans react","content":"MI captain Rohit Sharma was declared out by third umpire after KKR opted for DRS for a caught behind. A video of Rohit's shocked reaction went viral on social media as the UltraEdge showed a spike even before the ball passed the bat. \"IPL should also include HotSpot,\" a fan tweeted. \"Very very poor umpiring this season,\" another wrote.","author":"Anmol Sharma","published":"2022-05-09T17:21:04.000Z"},{"category":"sports","title":"KKR keep their IPL 2022 playoffs hopes alive with 52-run victory against MI","content":"KKR defeated MI by 52 runs in IPL 2022 on Monday to stay in the contention for a playoffs berth. With the win, KKR moved to the seventh spot from ninth spot on the points table. MI have now lost nine matches in the tournament. KKR will next face SRH on Saturday, while MI will next face CSK on Thursday.","author":"Anmol Sharma","published":"2022-05-09T17:52:03.000Z"},{"category":"sports","title":"This young hero will become a superhero for MI: Irfan on Tilak Varma","content":"Praising Tilak Varma, ex-India cricketer Harbhajan Singh said the MI batter is like an \"investment\" for the franchise. Ex-India all-rounder Irfan Pathan lauded the 19-year-old batter, saying this \"young hero will become a superhero\" for MI if he continues to play like he's playing in the ongoing IPL. Tilak has scored 328 runs from 10 matches so far.","author":"Anant Kaur","published":"2022-05-09T14:46:09.000Z"},{"category":"sports","title":"KKR's management is to blame for their performances in IPL 2022: Kaif","content":"Talking about KKR, who are currently placed ninth in the IPL 2022 standings, Mohammad Kaif said the KKR management is to blame for their current situation as they have done a lot of \"chopping and changing\". He added that too many changes added pressure on the players and it became difficult for them to play in that environment.","author":"Anant Kaur","published":"2022-05-09T15:14:10.000Z"},{"category":"sports","title":"Sometimes a break from the game is all you need: Vaughan on Kohli","content":"Referring to Virat Kohli's form in the ongoing IPL season, former England captain Michael Vaughan said, \"Sometimes a break from the game is all a player needs.\" He added, \"The amount of cricket these players play, a break is as good as anything.\" Kohli has registered three golden ducks and has scored 216 runs in 12 games so far. ","author":"Ankur Taliyan","published":"2022-05-09T11:23:07.000Z"},{"category":"sports","title":"He's gone better and better: Hesson on Hasaranga after his 5\/18 vs SRH","content":"Praising Wanindu Hasaranga following his 5\/18 in RCB's 67-run win against SRH in IPL 2022, RCB Director of Cricket Operations Mike Hesson said the spinner has gone better and better as the tournament has progressed. \"He...sort of packs a punch, he usually gets himself a lot of ground...generates a lot of power and a lot of leverage,\" he added.","author":"Anant Kaur","published":"2022-05-09T17:38:50.000Z"},{"category":"sports","title":"Once a king, always a king: Harbhajan to Bumrah on his 5\/10 vs KKR","content":"Following MI pacer Jasprit Bumrah's five-wicket haul against KKR in IPL 2022, Harbhajan Singh tweeted, \"Once a king, always a king. What a phenomenal spell by Bumrah.\" S Badrinath took to Twitter and wrote, \"Form is temporary, class is permanent. Boom boom performance.\" Bumrah posted bowling figures of 4-1-10-5 to help restrict KKR to 165\/9 in 20 overs.","author":"Anant Kaur","published":"2022-05-09T17:42:43.000Z"},{"category":"sports","title":"91-run win vs DC gives us lot of confidence: CSK all-rounder Moeen","content":"After CSK's 91-run win over DC in IPL 2022, CSK all-rounder Moeen Ali said winning against a great side boosts the team's confidence going forward. \"Any win at the moment is great for us,\" he added. Moeen posted bowling figures of 4-0-13-3. The defending champions are at the eighth spot on the points table with four wins in 11 matches. ","author":"Anant Kaur","published":"2022-05-09T11:41:08.000Z"},{"category":"sports","title":"Happy to build partnership with Gaikwad: Conway after 91-run win over DC","content":"After posting 110 runs opening partnership and helping his side win by 91 runs against DC, CSK opener Devon Conway has said that he is happy to \"build the partnership\" with opening partner Ruturaj Gaikwad. \"The way he is playing eases my job. Being an all-format player is my brand,\" Conway said after scoring 87 runs off 49 balls.","author":"Mohammad Anab","published":"2022-05-09T10:35:11.000Z"},{"category":"sports","title":"Better if wins had come earlier in the season: Dhoni after CSK's 4th win","content":"After CSK won their fourth match of IPL 2022 by defeating Delhi Capitals by 91 runs, skipper MS Dhoni said that it would have been \"better\" if wins had \"come earlier\" in the season. \"The big-margin win helps...But this was a perfect game,\" Dhoni said. After losing seven matches, CSK is currently at the eighth position in the points table.","author":"Mohammad Anab","published":"2022-05-09T10:40:22.000Z"},{"category":"sports","title":"I fully back every decision Pant takes on the field: Ponting","content":"DC head coach Ricky Ponting said he \"fully backs every decision\" that Rishabh Pant takes on the field during their matches. \"It's easy to make judgments from outside but...when you're in the middle it's not an easy thing to do,\" he added. DC have lost six of their 11 games and are placed fifth on the IPL 2022 points table. ","author":"Ankur Taliyan","published":"2022-05-09T10:25:49.000Z"},{"category":"sports","title":"Pitch didn't suit pace bowling: Josh Hazlewood after win over SRH","content":"After defeating SRH by 67 runs, RCB pacer Josh Hazlewood has said that the Wankhede Stadium's pitch didn't suit pace bowling. \"The wicket probably got drier as the match went on. Being a day game, it deteriorated and we took the pace off. Our spinners bowled really well...Tonight's wicket didn't suit pace (bowling),\" Hazlewood said.","author":"Mohammad Anab","published":"2022-05-09T11:26:19.000Z"},{"category":"sports","title":"Babar Azam is the best batter in world at the moment: Vettori","content":"On being asked who is the best batter in the world right now, ex-New Zealand captain Daniel Vettori said, \"Babar Azam is the most in-form batter on the back of his series against Australia.\" Babar was the second highest run-getter in Australia-Pakistan ODI series behind Imam-ul-Haq. The Pakistan captain is currently ranked number one in ICC ODI and T20I rankings.\n","author":"Anant Kaur","published":"2022-05-09T13:04:32.000Z"},{"category":"sports","title":"Yesterday, I went to bed at 5:20 am: Zverev after Madrid Open defeat","content":"World number three Alexander Zverev criticised the ATP Tour for its scheduling of late-night matches after he lost to 19-year-old Carlos Alcaraz in the Madrid Open final in straight sets. \"Two days ago, I went to bed at 4:30 am. Yesterday, I went to bed at 5:20 am,\" revealed Zverev, who had his semi-final against Stefanos Tsitsipas late Saturday night. ","author":"Ankur Taliyan","published":"2022-05-09T11:05:43.000Z"},{"category":"sports","title":"19-yr-old Alcaraz beats Zverev to win Madrid Open for 4th title of 2022","content":"World number six Carlos Alcaraz won his second ATP Masters 1000 title of 2022 after beating second-seeded Alexander Zverev 6-3, 6-1 at Madrid Open on Sunday. Overall, it was the 19-year-old's fourth title this season. Notably, Alcaraz became the youngest winner in Madrid and the second youngest to win two Masters 1000 titles since Rafael Nadal in 2005.","author":"Anant Kaur","published":"2022-05-09T10:53:09.000Z"},{"category":"sports","title":"Pak to tour Sri Lanka for just 2 Tests, ODIs removed on SLC's request","content":"Pakistan will play only a two-match Test series during their tour of Sri Lanka in the month of July-August as the three-match ODI series has been cancelled as per requests from Sri Lanka cricket board. Final dates are yet to be announced. While Test series is part of World Test Championship 2021-23, ODIs weren't included in World Cup Super League.","author":"Anant Kaur","published":"2022-05-09T14:15:23.000Z"},{"category":"sports","title":"I hope Man Utd continue to stick with Ronaldo: Beckham","content":"Amid calls for reforms at Manchester United ahead of the next season, former English footballer David Beckham hopes that the five-time Ballon d'Or winner Cristiano Ronaldo remains in the club's plans. \"It's important to him...we all know how much United means to him. He's still doing what he does best...so hopefully it continues for another year or two,\" Beckham said.","author":"Mohammad Anab","published":"2022-05-09T11:50:54.000Z"},{"category":"sports","title":"India beat Canada 5-0 to qualify for knockouts at 2022 Thomas Cup","content":"India reached the knockout stage of 2022 Thomas Cup Finals after a 5-0 win against Canada in their Group C match in Bangkok on Monday. Notably, this is India's second successive win in the group. Ex-world number one Kidambi Srikanth gave India 1-0 lead followed by two doubles and two singles match wins. India will face Chinese Taipei on Wednesday.","author":"Anant Kaur","published":"2022-05-09T17:05:08.000Z"},{"category":"sports","title":"I want to keep on improving like Federer, Nadal, Djokovic: Alcaraz","content":"World number six Carlos Alcaraz, who recently won tour-leading fourth title of the year at Madrid Open, said he looks up to Roger Federer, Rafael Nadal and Novak Djokovic as they don't stop improving. \"I want to keep on progressing. I have really good shots...but I know that I can improve them and they can be even better,\" he added.","author":"Anant Kaur","published":"2022-05-09T16:30:38.000Z"},{"category":"sports","title":"Indian women's team beat Canada in their Thomas and Uber Cup opener","content":"Indian women's badminton team beat Canada 4-1 in their opener in Group D at Thomas and Uber Cup Finals in Bangkok on Sunday. Two-time Olympic medallist PV Sindhu gave India 1-0 lead before Canada levelled it 1-1 following Shruti Mishra and Simran Singhi's loss in their doubles match. Later, India won their one doubles and two singles matches.\n","author":"Anant Kaur","published":"2022-05-09T12:07:31.000Z"},{"category":"technology","title":"Bitcoin falls to the lowest level since January, trades below $34,000","content":"Bitcoin fell on Monday to as low as $33,266 in morning trade, nearing January's low of $32,951 as slumping equity markets continued to hurt cryptocurrencies. It then steadied to trade above $33,600. According to BBC, the world's largest cryptocurrency has fallen by 50% since its peak in November 2021.","author":"Pragya Swastik","published":"2022-05-09T09:20:34.000Z"},{"category":"technology","title":"What is the passwordless sign-in tech that Google, Apple & Microsoft teamed up for?","content":"Google, Microsoft and Apple on May 5 announced they are teaming up to expand support for a common passwordless sign-in standard created by the FIDO Alliance and the World Wide Web Consortium. Through the new system, sign-ins will be possible through the same actions that users take to unlock their devices, like fingerprint or face verification or a device PIN.","author":"Sakshita Khosla","published":"2022-05-08T14:22:31.000Z"},{"category":"technology","title":"17-year-old boy builds 'mind-controlled' robotic arm in US, pic surfaces","content":"A 17-year-old from Virginia in the US has invented a robotic prosthetic arm that can be controlled by the mind. Benjamin Choi used his sister's 3-D printer and some fishing line to print individual parts of the arm and then bolted them all together. It uses an artificial intelligence (AI) algorithm to interpret the user's brain waves.","author":"Sakshita Khosla","published":"2022-05-09T11:41:19.000Z"},{"category":"technology","title":"Amazon driver leaves 'kind' message for girl fighting cancer in US, Bezos reacts","content":"Amazon Founder Jeff Bezos took to Instagram Stories to share the story of Amazon driver Asani Anderson who left a message for an 8-year-old girl battling cancer in US while dropping off packages. \"Amazon is praying 4 Aubrey luv you!\" the message by Anderson read. Reacting to the gesture, Bezos wrote on Instagram, \"Kindness makes our world better...Anderson embodies it.\"","author":"Hiral Goyal","published":"2022-05-07T11:23:23.000Z"},{"category":"technology","title":"I saw the Taj Mahal in 2007, it's truly a wonder of the world: Elon Musk","content":"World's richest man Elon Musk on Monday tweeted, \"It's amazing. I visited in 2007 and also saw the Taj Mahal, which truly is a wonder of the world.\" Musk was responding to a tweet that claimed to show a facade from a fort in Agra. Several Indian Twitter users responded to Musk's tweet, asking, \"Any plans to visit India soon?\"","author":"Pragya Swastik","published":"2022-05-09T17:35:30.000Z"},{"category":"technology","title":"Baseless and untrue: ED as Xiaomi alleges it threatened staff with 'violence'","content":"After Xiaomi alleged in a court filing that its top executives faced threats of \"physical violence\" during a probe by the Enforcement Directorate (ED), the agency responded saying that the claims are \"untrue and baseless\". The ED said that \"there was no coercion or threat to the officers of the company\" and that they deposed their statements before ED voluntarily.","author":"Hiral Goyal","published":"2022-05-07T11:51:03.000Z"},{"category":"technology","title":"Faulty battery cells caused e-scooter fires, initial govt probe finds: Report","content":"An initial investigation by a government agency into the recent electric scooter fires in India has found faulty battery cells and modules as the leading cause, Reuters reported. The probe reportedly looked into fire incidents involving Ola, Okinawa and Pure EV scooters. \"In Ola's case, the battery cells were found to be an issue,\" Reuters quoted a source as saying.","author":"Hiral Goyal","published":"2022-05-07T16:26:46.000Z"},{"category":"technology","title":"Job interest in Twitter rises over 250% after it accepts Musk's buyout deal","content":"The interest in Twitter jobs on Glassdoor rose 263% in a week after Twitter accepted Elon Musk's $44 billion takeover bid. The data was shared on Twitter by Daniel Zhao, Glassdoor's lead data scientist. \"Say what you will about Elon, he does have a large fanbase of people excited to work for him,\" Zhao tweeted.","author":"Pragya Swastik","published":"2022-05-09T09:15:42.000Z"},{"category":"technology","title":"'Got a call saying I'm laid off,' says woman days before she was due to join Meta","content":"In a widely-shared LinkedIn post, Stephanie Washington, who was hired as a Recruiting Coordinator for Meta, said she was laid off just days before she was due to join the workplace. \"I just signed...apartment lease 15 minutes before my manager called me...They are only compensating us for six weeks of pay after a month-long process of interviews,\" she wrote.","author":"Daisy Mowke","published":"2022-05-07T13:55:48.000Z"},{"category":"technology","title":"Anonymity is an 'inherent risk' in use of blockchain tech: FM Sitharaman","content":"Finance Minister Nirmala Sitharaman said anonymity is an \"inherent risk\" in use of blockchain technology and urged people to take precaution in future with a rise in the use of this technology. Calling distributed ledger technology (DLT) \"beautiful\", she added, \"Unless we...guard ourselves against that anonymous element...we'll be exposing ourselves much more than...we would've imagined.\"","author":"Hiral Goyal","published":"2022-05-07T14:10:37.000Z"},{"category":"technology","title":"Who is Jared Birchall, who manages the world's richest man Elon Musk's wealth?","content":"Jared Birchall is the Managing Director of Excession, the family office of the world's richest man Elon Musk that handles his almost $250 billion fortune. Birchall also serves various roles at the Musk Foundation, Musk's school Ad Astra and his brain-implant startup Neuralink, and several of Musk's other LLCs. He has recently helped Musk secure financing for $44-billion Twitter takeover.","author":"Hiral Goyal","published":"2022-05-07T15:55:51.000Z"},{"category":"technology","title":"Best investment you'll make: Poonawalla suggests Musk to make Tesla cars in India","content":"The Serum Institute of India's Adar Poonawalla on Sunday suggested Tesla CEO Elon Musk to invest in India by manufacturing Tesla cars in the country. Poonawalla wrote, \"Just in case you don't end up buying Twitter, do look at investing...in India for high-quality large-scale manufacturing of Tesla cars. I assure you this will be the best investment you'll ever make.\"","author":"Ridham Gambhir","published":"2022-05-08T08:45:59.000Z"},{"category":"technology","title":"Japan will cease to exist, Venice dying due to very low birth rates: Musk","content":"The world's richest man Elon Musk recently tweeted, \"At the risk of stating the obvious, unless something changes to cause the birth rate to exceed the death rate, Japan will eventually cease to exist.\" He added, \"This would be a great loss for the world.\" In another tweet, Musk said, \"Venice is slowly dying due to very low birth rates.\"","author":"Pragya Swastik","published":"2022-05-09T13:17:57.000Z"},{"category":"technology","title":"I'm okay with going to hell: Musk after 'If I die under mysterious circumstances' tweet","content":"World's richest man Elon Musk tweeted, \"I'm ok with going to hell, if that is indeed my destination, since the vast majority of all humans ever born will be there.\" Musk's tweet came hours after he tweeted, \"If I die under mysterious circumstances, it's been nice knowing ya.\" Musk's tweets sparked speculation about whether he was receiving threats from Russia.","author":"Pragya Swastik","published":"2022-05-09T13:19:04.000Z"},{"category":"technology","title":"Tesla accuses ex-engineer of returning dummy laptop after stealing data secrets","content":"Tesla has sued former engineer, Alexander Yatskov, for allegedly transferring confidential information on its supercomputer technology to his personal devices and turning over a \"dummy\" laptop to cover up theft. Yatskov quit in May and has refused to return the stolen data, claimed Tesla. The company also accused him of lying on his resume about his expertise and work experience.","author":"Hiral Goyal","published":"2022-05-08T12:50:51.000Z"},{"category":"technology","title":"Elon Musk planning a new Twitter product codenamed 'X': Report","content":"World's richest man Elon Musk, who's acquiring Twitter for $44 billion, plans to launch a new Twitter product codenamed \"X\", according to his investor presentation obtained by The New York Times. Musk expects to launch the product in 2023 and estimates it would have nine million subscribers in its first year and 104 million subscribers by 2028, the NYT reported.","author":"Hiral Goyal","published":"2022-05-08T17:20:58.000Z"},{"category":"technology","title":"I will do my best to stay alive: Musk to his mother after 'mysterious dying' tweet","content":"Soon after Tesla CEO Elon Musk shared a tweet about his \"mysterious death\", his mother Maye Musk commented that it wasn't funny. Responding to her, Musk wrote, \"Sorry! I will do my best to stay alive.\" Musk's 'dying' tweet came after he shared a statement by the Roscosmos director that threatened him for supplying \"fascist forces\" to Ukraine. ","author":"Ridham Gambhir","published":"2022-05-09T04:21:36.000Z"},{"category":"technology","title":"Work ethic expectations from Twitter employees will be extreme: Elon Musk","content":"The world's richest man Elon Musk tweeted \"work ethic expectations would be extreme\" after he completes the $44 billion acquisition of Twitter. He added that expectations from Twitter employees will be \"much less than I demand of myself\". Musk earlier said Twitter will be \"super focussed\" on software engineering, design, information security and server hardware after he acquires Twitter.","author":"Hiral Goyal","published":"2022-05-07T17:23:36.000Z"},{"category":"technology","title":"If I die under mysterious circumstances, nice knowing ya: Musk after Russian threats","content":"Tesla CEO Elon Musk has tweeted, \"If I die under mysterious circumstances, it's been nice knowing ya.\" Shortly before this, Musk shared a post that he said was a statement by the Roscosmos director Dmitry Olegovich Rogozin to Russian media that accused Musk of supplying \"fascist forces in Ukraine\". \"Elon, you'll be held accountable like an adult,\" the statement read.\n","author":"Ridham Gambhir","published":"2022-05-09T03:20:24.000Z"},{"category":"technology","title":"Facebook to drop Nearby Friends, other location-based features","content":"Facebook has started notifying its users that its Nearby Friends, weather alerts, location history and other location-based features won't be available after May 31, 9to5Mac reported. All user information related to these features will reportedly be deleted from Facebook's servers. Users can download their background location data and location history till August 1, the report added.\n","author":"Ananya Goyal","published":"2022-05-08T11:04:33.000Z"},{"category":"technology","title":"EU law regulating Apple, Google to come into effect in spring 2023","content":"The European Union will begin enforcing the Digital Markets Act (DMA) in spring 2023, European Commission Executive Vice President Margrethe Vestager has stated. The antitrust law aims to curb the power of 'gatekeeper companies', including Meta, Google, Microsoft, Apple and Amazon. If found violating rules repeatedly, these entities could be fined up to 20% of their total global turnover.","author":"Ananya Goyal","published":"2022-05-09T09:52:44.000Z"},{"category":"technology","title":"Imported EV cells may not be suitable for Indian conditions: NITI Aayog member","content":"Battery cells imported for electric vehicles (EVs) may not be suitable for Indian conditions, NITI Aayog Member VK Saraswat said after multiple incidents of EVs catching fire were reported from across the country. \"We should make sure that whatever cells we manufacture are suitable for Indian conditions of high temperature,\" Saraswat said. We must rigorously test imported cells, he added.","author":"Ashley Paul","published":"2022-05-09T16:37:24.000Z"},{"category":"technology","title":"Humans will land on Mars within this decade: SpaceX President","content":"SpaceX President and COO Gwynne Shotwell told CNBC that SpaceX will likely land humans on Mars before the end of the 2020s. \"I think it'll be in this decade, yes. People on the moon, sooner,\" Shotwell said. She added, \"We need to get a large delivery to the surface of Mars, and then people will start thinking harder about it.\"","author":"Ananya Goyal","published":"2022-05-09T14:29:12.000Z"},{"category":"technology","title":"Instagram to support NFTs from Ethereum, Polygon, Solana: Report","content":"Instagram is set to allow users to post and share their non-fungible tokens (NFTs) on the platform, CoinDesk reported. As per the report, Instagram is planning NFT integration with Ethereum, Polygon, Solana and Flow, which are the networks that host the majority of trading in NFTs. The pilot will reportedly feature a small group of US-based NFT enthusiasts.","author":"Ananya Goyal","published":"2022-05-09T11:25:11.000Z"},{"category":"entertainment","title":"Singapore to ban 'The Kashmir Files', says 'it may disrupt religious harmony'","content":"Singapore will ban the Hindi Bollywood movie 'The Kashmir Files' as it has been assessed to be \"beyond\" the city-state's film classification guidelines, authorities told Channel News Asia. It has been refused classification due to its \"provocative and one-sided portrayal\" of the 1990 Kashmiri Hindu exodus, they said. It has the \"potential to...disrupt social...and religious harmony\", they added.","author":"Sakshita Khosla","published":"2022-05-09T15:18:58.000Z"},{"category":"entertainment","title":"Arjun Kapoor shares before-after pics showing his physical transformation","content":"Actor Arjun Kapoor took to Instagram to share before-after pictures showing his physical transformation. He wrote, \"15 months of being #workinprogress...I'm immensely proud of this journey. Feb 2021 to May 2022...it's been a tough one and I'm only glad that I could stay on track.\" He added, \"I'm loving the state of mind...I'm in for these past 15 months.\"","author":"Anmol Sharma","published":"2022-05-09T11:20:37.000Z"},{"category":"entertainment","title":"Aayush Sharma refutes reports of grandfather's death, says 'he's fighting'","content":"Actor Aayush Sharma refuted reports of his politician grandfather Pandit Sukh Ram's death saying, \"[He is] fighting back bravely.\" Sharma said, \"In this testing time for our entire family, I kindly request everyone to pray for his well-being and refrain the media from paying heed to any false news.\" The ex-Telecom Minister was hospitalised following a brain stroke.","author":"Sakshita Khosla","published":"2022-05-09T13:51:18.000Z"},{"category":"entertainment","title":"I think Bollywood can't afford me, I don't want to waste my time: Mahesh Babu","content":"Telugu cinema star Mahesh Babu on Monday said, \"I always wanted to do Telugu films and wished people across India would watch it. And now when that is happening, I'm very happy.\" He added, \"I may sound arrogant...I did get a lot of offers in Hindi. But I think they can't afford me. I don't want to waste my time.\"","author":"Pragya Swastik","published":"2022-05-09T17:16:07.000Z"},{"category":"entertainment","title":"People taunted me for not getting pregnant, tried IVF: Sambhavna","content":"Actress Sambhavna Seth has revealed that she has been taunted and age-shamed for not being able to get pregnant even after many years of marriage. Sambhavna and her husband Avinash Dwivedi got married in 2016. \"IVF is one of the ways. Some people might know about it, some might not. We have tried it four times and failed,\" Sambhavna said.","author":"Kriti Kambiri","published":"2022-05-09T11:42:26.000Z"},{"category":"entertainment","title":"I'm fortunate I got to work with Akshay sir: Manushi Chhillar on Prithviraj","content":"When asked how it was working with Akshay Kumar in 'Prithviraj', former Miss World Manushi Chhillar said, \"It's my first film so it'll always be special. I'm fortunate that I got to work with Akshay sir.\" \"Yash Raj [Films] has launched me and [Dr Chandraprakash Dwivedi] directed my first film. So definitely 'Prithviraj' is very special to me,\" she added.","author":"Mahima Kharbanda","published":"2022-05-09T11:38:52.000Z"},{"category":"entertainment","title":"He's done right thing: Neetu on Ranbir not being on social media","content":"Actress Neetu Kapoor has said that her son Ranbir Kapoor has done the right thing by not being on any social media platforms. Neetu further said that earlier fans had a craze for celebrities and their personal lives and the urge to see them onscreen was high. Now actors post regular updates and have become way more accessible, she added.","author":"Kriti Kambiri","published":"2022-05-09T15:09:18.000Z"},{"category":"entertainment","title":"Nimrat Kaur shares pic of tattoo, says got it for mom with sister","content":"Actress Nimrat Kaur shared a series of pictures on Instagram showing off her wrist tattoo on Sunday to mark Mother's Day. The actress wrote that she got the tattoo along with her sister Ruby five years ago to celebrate their bond with their mother. \"The idea of an infinity knot symbolising Mama...protecting me and Ruby with her love,\" Nimrat wrote.","author":"Kriti Kambiri","published":"2022-05-09T15:23:03.000Z"},{"category":"entertainment","title":"Malavika Mohanan to star opposite Prabhas in thriller 'Raja Deluxe': Report","content":"Malavika Mohanan has reportedly been roped in to play the female lead in an upcoming supernatural action thriller titled 'Raja Deluxe', which will also feature Prabhas. It'll be directed by Maruthi and produced by 'RRR' producer DVV Danayya, according to the report. \"The team has...decided to start work on film from the month of August,\" Pinkvilla said quoting a source. ","author":"Udit Gupta","published":"2022-05-09T11:01:20.000Z"},{"category":"entertainment","title":"Took me a while to break it: Isha Koppikar on being typecast post Ishq Samundar","content":"Isha Koppikar, who has been a part of several movies, spoke about how she was typecast after her songs 'Ishq Samundar' and 'Khallas'. \"If I had known this earlier, I wouldn't have probably done [these songs],\" she said. \"It was 'Khallas' and it was backed by 'Ishq Samundar'...It took me quite a while to break that typecast,\" she added.","author":"Mahima Kharbanda","published":"2022-05-09T11:02:25.000Z"},{"category":"entertainment","title":"I finished my work on 'Prithviraj' in just 42 days: Akshay Kumar","content":"Akshay Kumar has revealed that he completed the shooting of his upcoming movie 'Prithviraj' in just 42 days. \"Come on time and leave on time, then film completes on time,\" he added. \"It was because of...pandemic that [it] got delayed, otherwise, [it] would've been released long back,\" said Akshay. 'Prithviraj' also stars Manushi Chhillar, Sonu Sood and Sanjay Dutt. ","author":"Udit Gupta","published":"2022-05-09T11:31:10.000Z"},{"category":"entertainment","title":"Comedy is the nicest genre; it's difficult to make people laugh: Samantha","content":"Actress Samantha Prabhu said that she wants to do more comedy films in the future. \"The most difficult thing is to make people laugh. You can make people cry, you can make people sad, but to make people laugh is truly difficult and that is what I love doing,\" she added. \"I feel comedy is the nicest genre,\" Samantha said.","author":"Mahima Kharbanda","published":"2022-05-09T11:34:46.000Z"},{"category":"entertainment","title":"OTT is huge but hard to say if OTT actors are stars: Sudhanshu Pandey","content":"Actor Sudhanshu Pandey has stated that there's no doubt OTT is huge and gives visibility to many actors who are now getting their due. However, it is hard to say whether OTT actors are becoming stars or not, he added. Sudhanshu further said that the television medium grew so much that TV stars are now as big as film stars.","author":"Kriti Kambiri","published":"2022-05-09T16:25:02.000Z"},{"category":"entertainment","title":"Unrealistic beauty standards, filters can be toxic: Paris Hilton","content":"American media personality Paris Hilton has said that the unrealistic beauty standards and filters on social media \"can be very toxic\". \"I can't imagine being 12, 13-years-old and seeing these beauty standards that are not real and using the filters all the time,\" Paris added. She further said that it's not really good for someone's mind at that age.","author":"Kriti Kambiri","published":"2022-05-09T13:48:33.000Z"},{"category":"entertainment","title":"U2's Bono, The Edge perform at bomb shelter in Ukraine's Kyiv","content":"Irish band U2's members Bono and The Edge performed at a bomb shelter in Ukraine's Kyiv after being invited by President Volodymyr Zelenskyy amid the Russian invasion. The duo performed for 40 minutes at the Khreshchatyk metro station to show their solidarity to Ukraine. The performance was attended by about 100 people including members of Ukraine's armed forces in uniforms.","author":"Kriti Kambiri","published":"2022-05-09T16:34:04.000Z"},{"category":"entertainment","title":"Dileep's wife questioned by Kerala Police in actress abduction case","content":"Malayalam actor Dileep's wife Kavya Madhavan was questioned by Kerala Police on Monday in connection with the Malayalam actress' abduction and assault case. Dileep is the co-accused in the case. Kavya is the only witness and was served a notice by the probe team to appear earlier. She had refused, saying it should be held at place which she wishes.","author":"Kriti Kambiri","published":"2022-05-09T14:26:18.000Z"},{"category":"entertainment","title":"Akshay only praised Kashmir Files as his film didn't work: Vivek","content":"Filmmaker Vivek Agnihotri in an interview has stated that actor Akshay Kumar only praised his film 'The Kashmir Files' because his own film 'Bachchhan Paandey' didn't work at the box office. \"What else can he say when 100 people stand and ask him about it? He was at a function in Bhopal so he had to praise it,\" Vivek added.","author":"Kriti Kambiri","published":"2022-05-09T10:30:58.000Z"},{"category":"entertainment","title":"Rajkummar, Janhvi's 'Mr & Mrs Mahi' goes on floors in Mumbai","content":"Rajkummar Rao and Janhvi Kapoor-starrer 'Mr & Mrs Mahi', backed by Karan Johar's Dharma Productions, went on floors in Mumbai on Monday. Karan took to Instagram Stories to share the news and wrote, \"Best of luck to the entire team...for starting the first innings! Knock it out of the park.\" The cricket drama is being helmed by Sharan Sharma. ","author":"Udit Gupta","published":"2022-05-09T10:44:33.000Z"},{"category":"entertainment","title":"Salman said I wasn't cut for B'wood, told me to try TV: Sidharth","content":"Actor Sidharth Malhotra has revealed that when he first met actor Salman Khan ahead of his debut, the former told him he wasn't cut out for Bollywood and should try his luck in TV. Sidharth made his debut in 2012 with 'Student of the Year'. Sidharth added Salman later said he made the comments to push him to do better.","author":"Kriti Kambiri","published":"2022-05-09T11:19:42.000Z"},{"category":"entertainment","title":"'Prithviraj' educational film, should be shown in schools: Akshay","content":"Akshay Kumar, speaking at the trailer launch of 'Prithviraj' on Monday, called it an educational film, adding that there's only a paragraph about the warrior in history books. The actor further requested the government to screen the film in schools as a mandatory event so children are told about Indian history. \"I want every child to watch it,\" Akshay added.","author":"Kriti Kambiri","published":"2022-05-09T12:17:14.000Z"},{"category":"entertainment","title":"Kids don't care: Kunal on Taimur being trolled for refusing pics","content":"Actor Kunal Kemmu has reacted to Saif Ali Khan's son Taimur being trolled for asking journalists to stop clicking his pictures, saying, \"Kids don't care...they don't have to be diplomatic.\" Kunal further said, \"But I think it's also the people who sit there wanting to comment on this, they need to change.\" Kunal is Saif's sister Soha Ali Khan's husband.","author":"Kriti Kambiri","published":"2022-05-09T13:04:05.000Z"},{"category":"entertainment","title":"Mahesh Babu recalls losing his 'dear ones', says 'A lot changed in these 2 yrs'","content":"During a speech at an event, actor Mahesh Babu recalled the hard times and loss of his dear ones in last two years. He said, \"In these two years...so much...changed. I've lost some of my dearest ones.\" \"But your love and support didn't change...I'll move forward bravely. On 12th May...'Sarkaru Vaari Paata' will release...it's a festival for...us,\" he added.","author":"Mahima Kharbanda","published":"2022-05-09T10:04:26.000Z"},{"category":"entertainment","title":"Broke down when daughter wasn't leaving ventilator: Mahi Vij","content":"Television actress Mahi Vij in an interview has revealed that her daughter Tara was born premature and was not leaving the ventilator. The actress added she tried IVF for the first time in 2014 aged 32. \"Tara was our last try...After that even if I was being given 100 injections I wouldn't feel the pain,\" Mahi said.","author":"Kriti Kambiri","published":"2022-05-09T10:22:21.000Z"},{"category":"entertainment","title":"Actress Mohena Kumari Singh shares first glimpse of her newborn son","content":"Actress-choreographer Mohena Kumari Singh took to Instagram on Sunday to share the first glimpse of her newborn son.  She also penned a poem for her son, which read, \"Can't keep my joy at bay. Just happy to be a mum today. Having a celebration with my little one in 2022 on...8th of May and why not...it's my first Mother's Day.\"  ","author":"Udit Gupta","published":"2022-05-09T11:28:33.000Z"},{"category":"entertainment","title":"'KGF 2' screened in Seoul; first Kannada film to be showcased in South Korea","content":"Yash starrer-'KGF: Chapter 2' had its screening in Seoul. It was the first Kannada film to be screened in South Korea along with its Hindi version. Several fans from India, Nepal and Bangladesh attended the screening in large numbers. Pictures of fans celebrating KGF 2's screening in Seoul have also surfaced online. The film has received tremendous response worldwide.","author":"Mahima Kharbanda","published":"2022-05-09T11:42:39.000Z"}]